[{"schema":{"elements":[{"name":{"some":"item_id"},"algebraic_type":{"Builtin":{"I32":[]}}},{"name":{"some":"scroll_type"},"algebraic_type":{"Builtin":{"I32":[]}}},{"name":{"some":"secondary_knowledge_id"},"algebraic_type":{"Builtin":{"I32":[]}}},{"name":{"some":"auto_collect"},"algebraic_type":{"Builtin":{"Bool":[]}}},{"name":{"some":"title"},"algebraic_type":{"Builtin":{"String":[]}}},{"name":{"some":"tag"},"algebraic_type":{"Builtin":{"String":[]}}},{"name":{"some":"content"},"algebraic_type":{"Builtin":{"String":[]}}}]},"rows":[[3180003,2,311,false,"Perfected Ferralith Hammer Recipe","Crafting Recipes","There are instructions detailing how to created a more powerful Ferralith tool."],[3180009,2,317,false,"Perfected Ferralith Saw Recipe","Crafting Recipes","There are instructions detailing how to created a more powerful Ferralith tool."],[3180004,2,312,false,"Perfected Ferralith Axe Recipe","Crafting Recipes","There are instructions detailing how to created a more powerful Ferralith tool."],[3000,1,0,true,"My (Possibly) Doomed Journey - Day 23","Ancient Journal","Only roots for dinner again today. That's two days since my supplies ran out, but I daren't complain too much, even here. The roots are plentiful, if not varied; and, thanks to that Hikmalat outcropping I passed yesterday, they are particularly nourishing. I guess all those hours poring over dusty books, learning which plants are safe to eat and where they grow, actually proved useful. Thank the Gift: I won't starve.\\n\\nCould do with some more flavor, though. I'll say that, though all my old scholarly friends will mock me mercilessly when they read this.\\n\\nIf they read this.\\n\\nIt was your idea, they'll say. You could be snug at the temple, enjoying three square meals with an abundance of color and flavor, and sleep tonight in a soft bed knowing that you have spent that day in the noble pursuit of learning. But no, and here's where they'll wave whatever book they're holding in my face, dust rippling from its pages and shimmering in stray shafts of sunlight, you had to see if the rumors were true. Wisdom and knowledge weren't enough for your ambition. You had to go seek another kind of temple. And you didn?t even pack enough food!\\n\\nThey?ll be right, of course, when they give me this speech?when I see them again.\\n\\nIf I see anyone again.\\n\\nBut I?m right too?by almighty Hikma, I swear I?m right. Those pilgrims who passed through last season couldn?t have been lying. They said they?d seen it: a temple just like ours, but devoted to story?to song?to beauty. Far away, of course . . . across the mountains, at the edge of the desert . . . but there. It exists.\\n\\nAnd I belong there. I?ve always known the scholarly life wasn?t for me. I couldn?t even keep a proper account of my days without weaving in tales?snatches of song?the odd sketch. Even in the driest, dustiest academic tome, I saw echoes of color . . . felt the frigid breath of ancient snowstorms . . . heard ghosts of tunes sung over old, forgotten campfires. I knew THAT knowledge was my vocation?my destiny?my true home.\\n\\nLook at me now: still keeping this Hikma-blasted journal, according to scholarly training, but waxing eloquent about dreams and destiny and old campfires. I don?t belong back there. I belong . . . ahead. Somewhere.\\n\\nWish I had one of those campfires here now, though. Or at least that I?d had the chance to practice building a fire, instead of just reading about it.\\n\\nI bet these roots would taste better cooked."],[507,1,0,true,"Apprehensive Adventurer's Note","Apprehensive Adventurer's Notes","I'll go no further. This whole place feels like it's about to come crumbling down. If only there was a way to see a safe path to mine through it."],[44,1,5004,false,"Dark Plank Road Knowledge","Paving Recipes",""],[1180013,2,500,false,"Blacksmith's Key","Crafting Recipes","Instructions on how to make a key."],[2180011,2,219,false,"Perfected Aurumite Scissors Recipe","Crafting Recipes","There are instructions detailing how to created a more powerful Aurumite tool."],[123457,2,12345,false,"The Art of Cheating - The Scroll","Cheater","Cheater. I hope you're a dev."],[3001,1,0,true,"Hymn to the Gieft","Ancient Journal","How strange, the perfect balance\\n\\nBetween the honor of being chosen\\n\\nAnd the terror of failing.\\n\\nThis perfection, both precise and beautiful\\n\\nLike the Radiant Gieft itself\\n\\nSteals my breath and turns my tongue to stone?\\n\\nBut I must speak.\\n\\nThe honor has been given, and\\n\\nLike the Radiant Gieft itself\\n\\nWe cannot?must not?doubt it.\\n\\nThe oncoming wave rises, within and without\\n\\nDrawing the manifold tides of uncertainty\\n\\nInto a single question:\\n\\nWhy her?\\n\\nToo young, too young, too?\\n\\nBut the honor has been given, and\\n\\nBefore the Radiant Gieft\\n\\nThis and every wave will turn to stone\\n\\nCrumble, and fall away?\\n\\nLike the old ways, the old questions\\n\\nThe old, imperfect vision of perfection\\n\\nThat bound us in the dark\\n\\nUntil the Radiant Gieft\\n\\nPlanted light within our very souls.\\n\\nSo I can speak\\n\\nI must speak\\n\\nTomorrow, I will speak\\n\\nAs the great light goes to rest\\n\\nAnd the lesser lights rush out, attending her departure\\n\\n?how I used to love them!\\n\\nI love them still, but now\\n\\nAs the harbingers of True Light\\n\\nPreparing us, by their faint dance\\n\\nTo receive the Radiant Gieft\\n\\nThen, in their silver glow\\n\\nWe will gather by the new valley\\n\\nIn reverence, in wonder\\n\\nAnd all will stand in silence?\\n\\nBut I will speak.\\n\\nI must speak\\n\\nFor the honor has been given\\n\\nAnd I must maintain the balance\\n\\nLest the terror consume us all.\\n\\nI will rise amidst my people\\n\\nBorne up by the wave of their questions\\n\\nDrawn to the True Light\\n\\nAnd before the Radiant Gieft\\n\\nSurely, my heart-speech will not falter:\\n\\nHail to the sky, which has given\\n\\nTo the ground, which has received\\n\\nTo our hands, which stretch between them\\n\\nUniting all in light.\\n\\nWe honor the past, which has prepared us\\n\\nThe present, which sustains us\\n\\nThe future, which awaits us\\n\\nEnfolding all in light.\\n\\nMay our wonder never darken\\n\\nMay your glory never tarnish\\n\\nWith our song ever ascending\\n\\nAwaking all to light."],[2180006,2,214,false,"Perfected Aurumite Sickle Recipe","Crafting Recipes","There are instructions detailing how to created a more powerful Aurumite tool."],[2180009,2,217,false,"Perfected Aurumite Saw Recipe","Crafting Recipes","There are instructions detailing how to created a more powerful Aurumite tool."],[2180003,2,211,false,"Perfected Aurumite Hammer Recipe","Crafting Recipes","There are instructions detailing how to created a more powerful Aurumite tool."],[42,1,5002,false,"Blue Cobblestone Road Knowledge","Paving Recipes",""],[40,1,5000,false,"Black Cobblestone Road Knowledge","Paving Recipes",""],[1180005,2,13,false,"Perfected Pyrelite Pickaxe Recipe","Crafting Recipes","There are instructions detailing how to created a more powerful Pyrelite tool."],[505,1,0,true,"Ancient Trapsmith's Journal Page #2","Trapped Ruins Notes","As I attempted to reinforce my safe room, the door collapsed. The irony of my own mechanisms turning on me is not lost on me. All I have left is my Hexite Infused Axe. I don't think I can get out."],[509,1,0,true,"Ancient Adventurer's Note","Ancient Adventurer's Notes","That pillar almost trapped me in that cellar! As I climbed the stairs to exit the basement, it came crumbling down and blocked the way. It's a shame, it seemed that there were some treasures down there . . ."],[3005,1,0,true,"The Last Lullaby","Ancient Journal","Sleep, my child; close your eyes\\n\\nDream of days when we were wise\\n\\nWhen gift-crops bloomed ?neath shining skies\\n\\nIn dreams, escape your mother?s sighs\\n\\nFor lo, we were not wise enough\\n\\nNot wise enough for you\\n\\nSleep, my child; day is gone\\n\\nNight alone must carry on\\n\\nFollowing the paths we?ve drawn\\n\\nMay you find the vanished dawn\\n\\nFor we cannot burn bright enough\\n\\nNot bright enough for you\\n\\nSleep, my child; do not wake\\n\\nTill once again the heavens shake\\n\\nThe earth?that you may rise to make\\n\\nA world not even we could break\\n\\nFor we were never strong enough\\n\\nPerhaps you will be strong enough\\n\\nOur love was never strong enough\\n\\nNot strong enough for you"],[3180007,2,315,false,"Perfected Ferralith Chisel Recipe","Crafting Recipes","There are instructions detailing how to created a more powerful Ferralith tool."],[41,1,5001,false,"Red Cobblestone Road Knowledge","Paving Recipes",""],[1180008,2,16,false,"Perfected Pyrelite Trowel Recipe","Crafting Recipes","There are instructions detailing how to created a more powerful Pyrelite tool."],[2180012,2,220,false,"Perfected Aurumite Cooking Pot Recipe","Crafting Recipes","There are instructions detailing how to created a more powerful Aurumite tool."],[1180015,2,1010,false,"Stone Brazier","Building Recipes",""],[503,1,0,true,"Ancient Adventurer's Letter #2","Trapped Ruins Notes","Freedom! Had those roots and vines grown any larger I may have spent the rest of my days trapped in this building. Hopefully no one else finds themselves stuck in this place."],[43,1,5003,false,"Teal Cobblestone Road Knowledge","Paving Recipes",""],[1180001,2,7,false,"Hunter's Bow Recipe","Crafting Recipes","There are faded instructions sketched in here detailing how to make a more powerful bow."],[1180004,2,12,false,"Perfected Pyrelite Axe Recipe","Crafting Recipes","There are instructions detailing how to created a more powerful Pyrelite tool."],[504,1,0,true,"Ancient Trapsmith's Journal Page #1","Trapped Ruins Notes","My home is now protected. I was forced to leave clues for which ways were safe to proceed because my memory simply isn't what it once was. The opposite room in the main hall provides a clue for this room. The torches are the key."],[1180007,2,15,false,"Perfected Pyrelite Chisel Recipe","Crafting Recipes","There are instructions detailing how to created a more powerful Pyrelite tool."],[45,1,5005,false,"Red Plank Road Knowledge","Paving Recipes",""],[46,1,5006,false,"Purple Plank Road Knowledge","Paving Recipes",""],[3003,1,0,true,"Follow the Stars","Ancient Journal","I know the stars see me. I only wish I could see them now.\\n\\nThey must know it is because of them that we are on this voyage. The Great Star fell, far to the north, and those who live by the stars must go to seek it.\\n\\n?It has begun,? the old ones said. Surely the Great Star is but the first to arrive?more will come, and when they do, we must be ready. For they are coming to take the faithful\\n\\nback to the skies: those who have always followed the stars will ascend to the heavens, and live among their divine kin forever.\\n\\nSo we must go to meet the Great Star. We must learn what preparations are required, and take the tidings?and the charted course?back to our people. But how can we find the way when\\n\\nour ancient heavenly map has veiled itself in clouds and storms?\\n\\nIt is not like me to be afraid. I am an experienced sea voyager; that is why they chose me. Me, and my young son?not young any more, practically a man?for we have ventured farther\\n\\nthrough these waters than any dare to go, and we always return. Even after the seas claimed my husband, we kept sailing.\\n\\n?How can you bear it?? my people asked, at the start of each new voyage. ?How can you trust yourself to the sea when it has taken so much from you?? I could not speak, but my son\\n\\nsmiled?his father?s smile?and gave his father?s old reply: ?The sea is treacherous; but the stars are ever faithful, and they will always lead us home.?\\n\\nI know the stars will lead us. We are out farther now than ever before, but though the shape of the stars may change, their song remains constant. I hear my husband?s spirit?hear\\n\\nhis whispers, even amidst the crashing of the waves and the howling of the storm. I hear his heart in my son?s voice as he comforts me.\\n\\nWe always knew our boy is special: he not only sees the stars, but hears them, and speaks to them. ?I hear them still, Mother,? he says, with that smile bright enough to light our\\n\\nway through the dark. ?They are speaking; they are singing; they will guide us to the Great Star that has fallen. Such a gift could not be given in vain.?\\n\\nI believe him. I know the stars will lead us. So great a gift would not simply abandon us to vanish beneath the waves.\\n\\nI know the stars hear him. I know they see me.\\n\\nI only wish I could see them tonight."],[1180009,2,17,false,"Perfected Pyrelite Saw Recipe","Crafting Recipes","There are instructions detailing how to created a more powerful Pyrelite tool."],[1180012,2,20,false,"Perfected Pyrelite Cooking Pot Recipe","Crafting Recipes","There are instructions detailing how to created a more powerful Pyrelite tool."],[3180005,2,313,false,"Perfected Ferralith Pickaxe Recipe","Crafting Recipes","There are instructions detailing how to created a more powerful Ferralith tool."],[2180004,2,212,false,"Perfected Aurumite Axe Recipe","Crafting Recipes","There are instructions detailing how to created a more powerful Aurumite tool."],[2180007,2,215,false,"Perfected Aurumite Chisel Recipe","Crafting Recipes","There are instructions detailing how to created a more powerful Aurumite tool."],[3004,1,0,true,"A Scholar's Rant","Ancient Journal","I give up.\\n\\nThere is simply too much to do. So, instead of doing any of it, I shall?naturally?sit here and whine about it. If anyone asks, I can simply tell them I am doing my job and\\n\\nanalyzing data, like a good scholar. No one has to know that what I?m analyzing is just how impossible that job is.\\n\\nData! Too much . . . so much data. Every day, new uses for the tool are discovered?blueprints for new machines are drawn up?new experiments are devised and put on the list to be\\n\\nimplemented. Even with the improved communication among our various facilities, it is madness to think we could ever record all of our findings accurately and comprehensibly. Our\\n\\nbrains simply aren?t designed for it (to say nothing of our hands; mine cramp every night from hours and hours of frantic scribbling).\\n\\nOh, how I wish I lived all those generations ago, when the tool first appeared. If our records?not to mention my own family history?are to be believed, the people saw it as a gift\\n\\nfrom the gods: to be worshiped and revered, not used or analyzed. My scholarly habits compel me to provide two logical reasons for such a backward-thinking wish: first, composing\\n\\nhymns in praise of the tool sounds much simpler and more relaxing than cataloging its multitudinous plethora of uses; second, I?d like to give those gods a piece of my mind for\\n\\nsending such a gift without better instructions.\\n\\nBut I don?t dare voice these desires anywhere but this journal. Ever since great-great-great uncle . . . . Marcus? Possibly? Never could get a definitive confirmation from\\n\\nGrandfather about that being his name?ran off to help found the first artistic facility, our family has been under constant scrutiny for being untrustworthy, or?GASP!?unscholarly.\\n\\nNever mind that he succeeded, and those facilities are now flourishing all over the world, in exquisite harmony with our centers of learning; no, all the people around here can\\n\\nfocus on is his unmitigated gall. Who in their right mind would prefer sketching and singing to STUDYING?\\n\\nSometimes, I feel a deep kinship with great-great-great uncle Possibly-Marcus.\\n\\nIf only this work could feel more like a song?or better yet, a conversation. If only the gods had sent not only the gift, but other beings along with it?some form of life clever\\n\\nenough to record all of this information, yet not so clever that they?d misuse the tool or wander off to use it for their own ends . . .\\n\\nIf only the wisdom we?ve gained from the tool could inspire us to invent such beings ourselves . . .\\n\\nIf only . . .\\n\\nI must away, journal of mine. I feel the spirit of great-great-great uncle Possibly-Marcus moving within me?but this time, I think the results may prove more academically useful\\n\\nthan any of my ancestors (or colleagues, hopefully) could dream\\n\\n"],[2180002,2,210,false,"Perfected Aurumite Knife Recipe","Crafting Recipes","There are instructions detailing how to created a more powerful Aurumite tool."],[508,1,0,true,"Helpful Adventurer's Note","Helpful Adventurer's Notes","This is 5th ruin I've explored in the past week. This one is much simpler and seemingly less dangerous. The others were riddled with traps or were just plain unstable. One wrong move and they'd come crumbling down! I've left notes with my findings in as many as I could. I hope it'll help future adventurers!"],[3180002,2,310,false,"Perfected Ferralith Knife Recipe","Crafting Recipes","There are instructions detailing how to created a more powerful Ferralith tool."],[2180008,2,216,false,"Perfected Aurumite Trowel Recipe","Crafting Recipes","There are instructions detailing how to created a more powerful Aurumite tool."],[3180012,2,320,false,"Perfected Ferralith Cooking Pot Recipe","Crafting Recipes","There are instructions detailing how to created a more powerful Ferralith tool."],[3002,1,0,true,"THAT GIFT-BLASTED THIEF HAS STOLEN MY SONG!","Ancient Journal","Not the music itself, of course; he didn?t open my head and pluck it out, or snip it from my soul. It?s still in there, somewhere. I could still sing it now?play it, too, if the\\n\\nroom would just stop spinning for one gifted moment. But the scroll, with the words and notes?the one I jotted down for my own personal use, and only showed to him once he was\\n\\ncrying so hard my head hurt . . . or maybe he was laughing. Was I laughing? That sounds right; we were singing, and laughing, and crying, and then . . . I woke up, and the scroll\\n\\nwas gone.\\n\\nSo he stole it . . . didn?t he?\\n\\nIt?s all muddy and swirling in my memory?but that?s why I?m here. Melly always says: ?Write it down, sort it out!? So, I?m writing . . . though the light is so bright on the paper,\\n\\nand the letters are all jumping around like they?re a jig come to life, and the words are bouncing around to the same tune in my head . . .\\n\\nA tune. That?s what started it.\\n\\nHe heard me before I saw him?said he did, anyway. Heard me whistling my new song as I was walking home, and caught up to me right outside the pub. ?Just passin? through,? he said,\\n\\n?collectin? tales and tunes as I go. Shall we trade a few, and share some drinks into the bargain??\\n\\nHe didn?t look evil?a tad unusual, but that?s to be expected with strangers. Tiny fella, but with a smile and a spirit big as a house. We don?t get too many newcomers, and precious\\n\\nlittle of new tales or tunes. A drink and a few stories sounded mighty fine, and I said as much, so into the pub we went.\\n\\nIt?s coming clear now?sorting itself out, just like Melly said it would. He didn?t ask for my tune straight out; he laid the trap all sweet and sunny, singing and playing songs and\\n\\nstories from places I?ve never heard of. But I saw them all last night?saw them, heard them, and felt myself there. That?s the main picture I can?t get out of my mind: that little\\n\\nfella, perched on the bench, wailing away on that lute like it was part of him, weaving us all into his spell.\\n\\nThen he asked me to share my tune, and it seemed only fitting to invite him back here, where I could play and sing in the comfort of home. No idea what time it was, though Melly\\n\\nseemed pretty put-out when we showed up at the door?I?ll get an earful about that today, for sure. I played my song, and he was surely the best listener I?ve ever had; he asked for\\n\\nit again, and played along this time, and then we played and sang it together, over and over. I felt right close to this little fella; he seemed to understand the song even better\\n\\nthan I did.\\n\\nNext thing I knew, I was showing him my song-scrolls. I even showed him my great-great-great grandpa?s journals: records of one of the first Song Sanctuaries ever built, back when\\n\\nthe Gift was mostly just used for learning.\\n\\nMighty precious, those journals?but he didn?t take them. He just took the song. I?m starting to remember . . . he did ask for it. Said he was collecting songs from all over, and\\n\\nkeeping a record for future generations, long after we?re all dead and gone . . . some high-minded mission or other. I said no, of course . . . or was it maybe? Or did I just fall\\n\\nasleep?\\n\\nNo matter: that silver-tongued traveler stole my song, and he?s gonna give it to all them future generations.\\n\\nMelly?s gonna have my hide."],[1180002,2,10,false,"Perfected Pyrelite Knife Recipe","Crafting Recipes","There are instructions detailing how to created a more powerful Pyrelite tool."],[2180005,2,213,false,"Perfected Aurumite Pickaxe Recipe","Crafting Recipes","There are instructions detailing how to created a more powerful Aurumite tool."],[1180011,2,19,false,"Perfected Pyrelite Scissors Recipe","Crafting Recipes","There are instructions detailing how to created a more powerful Pyrelite tool."],[502,1,0,true,"Ancient Adventurer's Letter #1","Trapped Ruins Notes","Whoever lived here certainly wanted no visitors. I attempted to open the doors to the left and right and they came crumbling down and almost collapsed the entire structure. The only door to open without disaster was the center one. I suspect that the torches are connected to the integrity of the doors. I don't think I'll push my luck though. I hope these notes help future adventurers find their way through this ruin."],[47,1,5007,false,"Blue Plank Road Knowledge","Paving Recipes",""],[1180003,2,11,false,"Perfected Pyrelite Hammer Recipe","Crafting Recipes","There are instructions detailing how to created a more powerful Pyrelite tool."],[3180008,2,316,false,"Perfected Ferralith Trowel Recipe","Crafting Recipes","There are instructions detailing how to created a more powerful Ferralith tool."],[1180006,2,14,false,"Perfected Pyrelite Sickle Recipe","Crafting Recipes","There are instructions detailing how to created a more powerful Pyrelite tool."],[506,1,0,true,"Baffled Adventurer's Note","Baffled Adventurer's Notes","Whoever designed this building deserves to be lost within it. This place is a maze, I constantly find myself back at the start! I can feel a draft flowing to the otherside, if only I could follow it!"],[3180006,2,314,false,"Perfected Ferralith Sickle Recipe","Crafting Recipes","There are instructions detailing how to created a more powerful Ferralith tool."]]}]